NTR/database/case_templates/openfoam_channel_les_dfsem_compressible/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\n
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;//sutherland;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   28.96; 	//Air [g/mol]
    }
    thermodynamics
    {
        Cv          715.5;	//air 
        Hf          0;
    }
    transport
    {
        mu	    20e-6;     	//dynamische viskositaet, aehnlich Luft
	Pr	    0.7;      	//prandtl-zahl, aehnlich Luft
    }
}



// ************************************************************************* //)
