NTR/database/case_templates/openfoam_channel_les_dfsem_compressible/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.042";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

    INLET
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        293.15;
        lInf            0.005;
        value           uniform 293.15;
    }
    OUTLET
    {
        type            waveTransmissive;
        gamma           1.4;
        value           uniform 293.15;
    }
    bottomWall
    {
	type	zeroGradient;
	value	293.15;
    }
    topWall
    {
	type	zeroGradient;
	value	293.15;
    }
}


// ************************************************************************* //
