NTR/database/case_templates/openfoam_channel_les_dfsem_compressible/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default           <var TIMEDTTSCHEME var>;
}
gradSchemes
{
    default           Gauss linear;
}

divSchemes
{

    default                             none;
    div(phi,U)                          Gauss LUST grad(U);
    div(phi,e)                          Gauss LUST grad(e);
    div(phi,K)                          Gauss limitedLinear 1.0;
    div(phiv,p)                         Gauss LUST grad(p);
    div(phi,k)                          Gauss limitedLinear 1.0;
    div(phi,B)                          Gauss limitedLinear 1.0;
    div(phi,muTilda)                    Gauss limitedLinear 1.0;
    div(B)                              Gauss limitedLinear 1.0;
    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(meshPhi,p)			Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default          linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}

// ************************************************************************* //
