NTR/database/case_templates/openfoam_channel_les_dfsem_compressible/system/fvSolution

/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//Massenstrom
	Phi
	{
	solver GAMG;
	smoother DIC;
	cacheAgglomeration on;
	agglomerator faceAreaPair;
	nCellsInCoarsestLevel 10;
	mergeLevels 1;

	tolerance 1e-12;
	relTol 0.005;
	}

//Druck Dichte
    "(p|rho)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.005;
    }

    "(p|rho)Final"
    {
        $p;
        relTol          0;
    }

    "(U|k|e|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.01;
    }

    "(U|k|nuTilda|e|omega)Final"
    {
        $U;
        relTol          0;
    }

    pcorr
    {
        solver	GAMG;
        smoother          GaussSeidel;
        tolerance 1e-08;
	relTol	0.0;
    }
}


PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 3;//1;	PISO
    nCorrectors     1;//1;	//outer loops
    nNonOrthogonalCorrectors 1;	//p loops
    rhoMin          0.2;
    rhoMax          3;
    transonic	no;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*"  1;
    }
}



// ************************************************************************* //
